Enums/УсловияРассмотренияПредшественниковЭтапа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УсловияРассмотренияПредшественниковЭтапа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НезависимоОтРезультатаВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеНеуспешногоВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеУспешногоВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеУспешногоСогласованияБезЗамечаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеУспешногоСогласованияСЗамечаниями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСКомплекснымиБизнесПроцессамиКлиентПереопределяемый/Ext/Module.bsl
Процедура УстановитьДоступностьУсловияРассмотрения(ТекущийЭтап, Элементы) Экспорт
	
	Элементы.УсловиеРассмотрения.РежимВыбораИзСписка = Истина;
	Элементы.УсловиеРассмотрения.СписокВыбора.Очистить();

	Если ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныИсполнения")
		ИЛИ ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныОзнакомления")
		ИЛИ ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныПоручения")
		ИЛИ ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныРассмотрения")
		ИЛИ ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныСоставныхБизнесПроцессов")
		ИЛИ ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов")
		Или ТекущийЭтап.ШаблонБизнесПроцесса = Неопределено Тогда
		
		Элементы.УсловиеРассмотрения.РежимВыбораИзСписка = Ложь;
		Элементы.УсловиеРассмотрения.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныУтверждения") Тогда
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоВыполнения"),
			НСтр("ru = 'Утверждено'; en = 'Confirmed'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеНеуспешногоВыполнения"),
			НСтр("ru = 'Не утверждено'; en = 'Not confirmed'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.НезависимоОтРезультатаВыполнения"),
			НСтр("ru = 'Любой результат'; en = 'Any result'"));
	ИначеЕсли ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныРегистрации") Тогда
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоВыполнения"),
			НСтр("ru = 'Зарегистрировано'; en = 'Registered'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеНеуспешногоВыполнения"),
			НСтр("ru = 'Не зарегистрировано'; en = 'Not registered'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.НезависимоОтРезультатаВыполнения"),
			НСтр("ru = 'Любой результат'; en = 'Any result'"));
	ИначеЕсли ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныСогласования") Тогда
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоВыполнения"),
			НСтр("ru = 'Согласовано'; en = 'Approved'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоСогласованияБезЗамечаний"),
			НСтр("ru = 'Согласовано без замечаний'; en = 'Agreed without reservations'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоСогласованияСЗамечаниями"),
			НСтр("ru = 'Согласовано с замечаниями'; en = 'Approved with reservations'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеНеуспешногоВыполнения"),
			НСтр("ru = 'Не согласовано'; en = 'Not approved'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.НезависимоОтРезультатаВыполнения"),
			НСтр("ru = 'Любой результат'; en = 'Any result'"));	
	ИначеЕсли ТипЗнч(ТекущийЭтап.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныПриглашения") Тогда
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоВыполнения"),
			НСтр("ru = 'Принято'; en = 'Accepted'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоСогласованияБезЗамечаний"),
			НСтр("ru = 'Принято всеми участниками'; en = 'Accepted by all participants'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеУспешногоСогласованияСЗамечаниями"),
			НСтр("ru = 'Принято обязательными участниками'; en = 'Accepted by mandatory participants'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.ПослеНеуспешногоВыполнения"),
			НСтр("ru = 'Не принято'; en = 'Not accepted'"));
		Элементы.УсловиеРассмотрения.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.УсловияРассмотренияПредшественниковЭтапа.НезависимоОтРезультатаВыполнения"),
			НСтр("ru = 'Любой результат'; en = 'Any result'"));	
	КонецЕсли;
		
КонецПроцедуры
